'''
Vat
เวลาเราไปร้านอาหารนั้น เราก็จะต้องจ่ายภาษีเพิ่มขึ้นจากค่าอาหารเดิมเป็นจำนวน 7% โดยที่เราก็ไม่รู้เลยว่าร้านอาหารนั้นคิดถูกหรือผิด

เนื่องจากน้องๆเก่งทางด้านเขียนโปรแกรม พี่ๆจึงอยากให้น้องเขียนโปรแกรมรับจำนวนเงินที่รวมภาษีแล้ว

นำมาคำนวณว่าในจำนวนเงินนั้นเป็นค่าอาหารจริงกี่บาท และภาษีกี่บาท

ให้หาค่าภาษีจาก ภาษี = ราคารวมภาษี - ราคาไม่รวมภาษี


Example 1
summary price : 107
food : 100.0
vat : 7.0

------------------------
Example 2
summary price : 3265
food : 3051.4018691588785
vat : 213.59813084112147

-------------------------
Example 3
summary price : 152.9
food : 142.89719626168224
vat : 10.002803738317766
'''

#--------------------input----------------------
sumPrice = float(input('summary price : '))

#-------------------calculation------------------
food = sumPrice * 100/107
# 107          ---------->     100
# sumPrice     ---------->     sumPrice * 100 /107

#-------------------output----------------------
print(f'food : {food}')
print(f'vat : {sumPrice - food}')